In [1]:
import pandas as pd

# load the data from Excel
data = pd.read_csv('dataset no 1.csv', delimiter=',')
data

    No       NAMA  UTS  TUGAS  UAS
0    1        Roy   89     90   75
1    2     Sintia   90     71   95
2    3      Iqbal   70     75   80
3    4      Dilan   45     65   59
4    5      Ratna   65     75   53
5    6      Merry   80     70   75
6    7       Rudi   90     85   81
7    8      Hafiz   70     70   73
8    9       Gede   96     93   85
9   10  Christian   60     55   48
10  11     Justin   45     60   58
11  12     Jesika   60     70   72
12  13        Ayu   85     90   88
13  14      Siska   52     68   55
14  15    Reitama   40     60   70

In [2]:
# Mencari nilai Min dan Max
minUTS = min(data.UTS)
maxUTS = max(data.UTS)

minTUGAS = min(data.TUGAS)
maxTUGAS = max(data.TUGAS)

minUAS = min(data.UAS)
maxUAS = max(data.UAS)

In [3]:
# Menentukan nilai k
k = 3;

# Menentukan medoids yang ingin dicoba sebanyak k
medoids = data.iloc[[2,8,9]]
medoids

   No       NAMA  UTS  TUGAS  UAS
2   3      Iqbal   70     75   80
8   9       Gede   96     93   85
9  10  Christian   60     55   48

In [4]:
cost1 = (medoids.UTS[2] - data.UTS)**2 + (medoids.TUGAS[2] - data.TUGAS)**2 + (medoids.UAS[2] - data.UAS)**2

# SquareRoot
cost1 = cost1**(1/2)
cost1

0     24.718414
1     25.317978
2      0.000000
3     34.146742
4     27.459060
5     12.247449
6     22.383029
7      8.602325
8     32.015621
9     39.038443
10    36.523965
11    13.747727
12    22.671568
13    31.591138
14    35.000000
dtype: float64

In [5]:
# Hitung jarak objek ke medoids sementara dengan Euqlidiance distance
cost2 = (medoids.UTS[8] - data.UTS)**2 + (medoids.TUGAS[8] - data.TUGAS)**2 + (medoids.UAS[8] - data.UAS)**2

# SquareRoot
cost2 = cost2**(1/2)
cost2

0     12.569805
1     24.899799
2     32.015621
3     63.725976
4     48.052055
5     29.748950
6     10.770330
7     36.728735
8      0.000000
9     64.101482
10    66.475559
11    44.654227
12    11.789826
13    58.830264
14    66.708320
dtype: float64

In [6]:
# Hitung jarak objek ke medoids sementara dengan Euqlidiance distance
cost3 = (medoids.UTS[9] - data.UTS)**2 + (medoids.TUGAS[9] - data.TUGAS)**2 + (medoids.UAS[9] - data.UAS)**2

# SquareRoot
cost3 = cost3**(1/2)
cost3

0     52.867760
1     58.008620
2     39.038443
3     21.118712
4     21.213203
5     36.796739
6     53.749419
7     30.822070
8     64.101482
9      0.000000
10    18.708287
11    28.301943
12    58.736701
13    16.792856
14    30.149627
dtype: float64

In [7]:
# jarak terdekat objek ke medoids dan hitung total
proximity = [min(x) for x in zip(cost1, cost2, cost3)]
proximity

[12.569805089976535,
 24.899799195977465,
 0.0,
 21.118712081942874,
 21.213203435596427,
 12.24744871391589,
 10.770329614269007,
 8.602325267042627,
 0.0,
 0.0,
 18.708286933869708,
 13.74772708486752,
 11.789826122551595,
 16.792855623746664,
 30.14962686336267]

In [8]:
# jumlah kedekatan / proximity
sumProximity = sum(proximity)
sumProximity

202.609946027119

In [9]:
from sklearn.cluster import KMeans
import numpy as np
import csv

# Membuka file csv dan membaca isinya
with open('dataset no 1.csv', 'r') as file:
    reader = csv.reader(file)
    # Melewati baris header
    next(reader)
    # Menyimpan data dalam list
    data = [row for row in reader]

# Mengambil nilai UTS, TUGAS, dan UAS sebagai fitur
X = np.array([[int(row[2]), int(row[3]), int(row[4])] for row in data if len(row) == 5])


for i in range(len(data)):
    if len(data[i]) == 5:
        print(f"{data[i][1]}: ", end="")
        if(cost2[i] == proximity[i]):
            print("Cluster 1")
        elif(cost3[i] == proximity[i]):
            print("Cluster 3")
        else:
            print("Cluster 2")

Roy: Cluster 1
Sintia: Cluster 1
Iqbal: Cluster 2
Dilan: Cluster 3
Ratna: Cluster 3
Merry: Cluster 2
Rudi: Cluster 1
Hafiz: Cluster 2
Gede: Cluster 1
Christian: Cluster 3
Justin: Cluster 3
Jesika: Cluster 2
Ayu: Cluster 1
Siska: Cluster 3
Reitama: Cluster 3